app/Controllers/Adm/Storage/StorageController.php

SELECT "storages".*, "products"."description", "products"."image"
FROM "storages"
JOIN "products" ON "products"."id" = "storages"."product_id"
ORDER BY "storages"."product_id" ASC
 LIMIT 2 OFFSET 4
---
    private function getItensFromStorage(string $description = null)
    {
        $db = db_connect('default');

        $page = (int)($this->request->getGet('page') ?? 1);

        $offset = abs(($page - 1) * 2);

        if (!$description) {
            return $db->table('storages')
                ->select('storages.*, products.description, products.image')
                ->join('products', 'products.id = storages.product_id')
                ->limit(2)
                ->orderBy('storages.product_id', 'asc')
                ->offset($offset)
                ->get()
                ->getResultObject();