app/Controllers/Adm/Storage/TypeProductController.php

SELECT *
FROM "type_products"
WHERE "type_products"."deleted_at" IS NULL
ORDER BY "id" ASC
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "type_products"
WHERE "type_products"."deleted_at" IS NULL
---
    public function listSearch(): string| object
    {
        // colocar filtro para saber se é ajax (middleware)
        $this->dataView = [
            'title' => 'ADM - Categorias de produto',
            'dashboard' => 'Lista de categorias',
            'account' => $this->auth->data()
        ];

        if (!is_null($typeProduct = $this->request->getGet('type_product'))) {

            if (!$this->typeProductModel->forSearchTypeProduct()->validate($this->request->getGet())) {
                return redirect()->back()->with('errors', $this->typeProductModel->errors());
            }

            $this->dataView['typeProduct'] = $typeProduct;
            $this->dataView['typeProductList'] = $this->typeProductModel->like('type_product', $typeProduct)->orderBy('id', 'asc')->paginate(10);
        } else {
            $this->dataView['typeProductList'] = $this->typeProductModel->orderBy('id', 'asc')->paginate(10);

INSERT INTO "type_products" ("type_product", "created_at", "updated_at") VALUES ('entradas', '2023-04-07 18:27:23', '2023-04-07 18:27:23')
---
    public function add(): object
    {
        // colocar filtro para checar se é post (middleware)
        $dataForm = $this->request->getPost();

        if (!$this->typeProductModel->validate($dataForm)) {
            return redirect()->back()->with('errors', $this->typeProductModel->errors());
        }

        $this->typeProductModel->insert($dataForm);