app/Controllers/Adm/Rh/ClientController.php

SELECT *
FROM "clients"
WHERE "type_user_id" = 1
AND "clients"."deleted_at" IS NULL
ORDER BY "id" ASC
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "clients"
WHERE "type_user_id" = 1
AND "clients"."deleted_at" IS NULL
---
    public function listSearch(): string|object
    {
        // colocar filtro para saber se é ajax (middleware)
        $this->dataView = [
            'title' => 'ADM - Clientes',
            'dashboard' => 'Lista de clientes',
            'account' => $this->auth->data()
        ];

        if (!is_null($name = $this->request->getGet('name'))) {

            if (!$this->clientModel->forSearchCliente()->validate($this->request->getGet())) {
                return redirect()->back()->with('errors', $this->clientModel->errors());
            }

            $this->dataView['name'] = $name;
            $this->dataView['clientList'] = $this->clientModel->where('type_user_id', 1)->like('name', $name)->orderBy('id', 'asc')->paginate(10);
        } else {
            $this->dataView['clientList'] = $this->clientModel->where('type_user_id', 1)->orderBy('id', 'asc')->paginate(10);

SELECT *
FROM "clients"
WHERE "clients"."deleted_at" IS NULL
AND "clients"."id" = 3
---
    private function findClientById(int $clientId): null|object
    {
        return $this->clientModel->find($clientId);