app/Controllers/Adm/Rh/EmployeeController.php

    public function listSearch(): string|object
    {
        // colocar filtro para saber se é ajax (middleware)
        $this->dataView = [
            'title' => 'ADM - Funcionários',
            'dashboard' => 'Lista de funcionários'
        ];
        if (!is_null($name = $this->request->getGet('name'))) {

            $this->validation->setRules($this->nameRules());

            if (!$this->validation->run($this->request->getGet())) {
                return redirect()->back()->with('errors', $this->validation->getErrors());
            }

            $this->dataView['name'] = $name;
            $this->dataView['employeeList'] = $this->employeeModel->where('type_user_id', 2)->like('name', $name)->orderBy('id', 'asc')->paginate(10);
        } else {
            $this->dataView['employeeList'] = $this->employeeModel->where('type_user_id', 2)->orderBy('id', 'asc')->paginate(10);
---
SELECT *
FROM "employees"
WHERE "type_user_id" = 2
AND "employees"."deleted_at" IS NULL
ORDER BY "id" ASC
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "employees"
WHERE "type_user_id" = 2
AND "employees"."deleted_at" IS NULL

    public function confirmDisable(): object
    {
        $decEmployee = $this->decryptEmployeeId(
            $this->request->getPost('employee_id')
        );

        $this->employeeModel->where('id', $decEmployee)->set(['is_active' => false])->update();
---
UPDATE "employees" SET "is_active" = FALSE, "updated_at" = '2023-04-03 19:04:03'
WHERE "id" = 29

    private function findEmployeeById(int $employeeId): null|object
    {
        return $this->employeeModel->find($employeeId);
---
SELECT *
FROM "employees"
WHERE "employees"."deleted_at" IS NULL
AND "employees"."id" = 1