app/Repository/ORMdefault/TypeProductRepository.php

SELECT *
FROM "type_products"
WHERE "type_products"."deleted_at" IS NULL
ORDER BY "id" ASC
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "type_products"
WHERE "type_products"."deleted_at" IS NULL
---
    public function getLike(string $like): array
    {
        return $this->model->like('type_product', $like)->orderBy('id', 'asc')->paginate(10);