app/Controllers/Adm/ProfileController.php

    public function saveEdit(): object
    {
        $dataForm = $this->checkEmptyFields($this->request->getPost());

        if (count($dataForm) < 1) {
            return redirect()->back()->with('warning', 'Não há dados para atualizar!');
        }

        if (!$this->employeeModel->validate($dataForm)) {
            return redirect()->back()->with('errors', $this->employeeModel->errors());
        }

        $this->employeeModel->where('id', $this->auth->id())->set($dataForm)->update();
---
UPDATE "employees" SET "email" = 'funcionario4_atualizado@mail.com', "updated_at" = '2023-04-07 00:02:54'
WHERE "id" = 7

    public function savePassword(): object
    {
        $dataForm = $this->request->getPost();

        $account = $this->employeeModel->where('id', $this->auth->id())->first();
---
SELECT *
FROM "employees"
WHERE "id" = 7
AND "employees"."deleted_at" IS NULL
 LIMIT 1