app/Controllers/Activation/EmployeeActivationController.php

    private function getEmployeeDataByEmail(object $account): null|object
    {
        return $this->employeeModel->where('email', $account->email)->first();
---
SELECT *
FROM "employees"
WHERE "email" = 'funcionario4@mail.com'
AND "employees"."deleted_at" IS NULL
 LIMIT 1

    private function getActivationDataByToken(string $token): null|object
    {
        $tokenHash = $this->token->getTokenHash();

        return $this->activationTokensModel->where('token_hash', $tokenHash)->first();
---
SELECT *
FROM "activation_tokens"
WHERE "token_hash" = '6635eb06fddaad62276ec87fc77c3075b0b0b1223d493a00ac1b24c75055e8bc'
 LIMIT 1