app/Libraries/Authentication/EmployeeAuthentication.php

SELECT *
FROM "employees"
WHERE "is_active" = TRUE
AND "id" = '7'
AND "employees"."deleted_at" IS NULL
 LIMIT 1
---
    private function getAuthDataFromSession(): null|object
    {
        if (!session()->has('employee_id')) {
            return null;
        }

        return $this->employeeRepository->getWhere([
            'is_active' => true,
            'id' => session()->get('employee_id')
        ], true);