app/Libraries/Authentication/EmployeeAuthentication.php

    private function getAuthDataFromSession(): null|object
    {
        if (!session()->has('employee_id')) {
            return null;
        }

        return $this->employeeModel->where('is_active', true)->where('id', session()->get('employee_id'))->first();
---
SELECT *
FROM "employees"
WHERE "is_active" = TRUE
AND "id" = '7'
AND "employees"."deleted_at" IS NULL
 LIMIT 1